[
  {
    "id": "tortoise-hare",
    "title": "The Tortoise and the Hare",
    "author": "Aesop",
    "source": "curated",
    "content": "Once upon a time, a speedy Hare bragged about how fast he could run. Tired of hearing him boast, the slow and steady Tortoise challenged him to a race. All the animals in the forest gathered to watch.\n\n\"This will be over before it starts!\" laughed the Hare. The fox waved a flag, and off they went!\n\nThe Hare sprinted ahead so quickly that the Tortoise was soon far behind. Feeling confident, the Hare decided to take a nap under a shady tree. \"I have plenty of time,\" he yawned. \"That Tortoise will never catch up.\"\n\nMeanwhile, the Tortoise kept walking. Step by step, slowly but surely, he plodded along the path. He didn't stop. He didn't rest. He just kept going.\n\nWhen the Hare finally woke up, he stretched and looked down the road. To his horror, the Tortoise was almost at the finish line! The Hare ran as fast as he could, but it was too late.\n\nThe Tortoise crossed the finish line first! All the animals cheered. The Tortoise smiled and said, \"Slow and steady wins the race.\"\n\nThe Hare learned an important lesson that day: being talented is wonderful, but hard work and persistence matter even more.",
    "summary": "A boastful hare loses a race to a persistent tortoise who never gives up.",
    "length": "short",
    "mood": ["educational", "funny"],
    "themes": ["animals"],
    "readingTimeMinutes": 2,
    "coverEmoji": "🐢"
  },
  {
    "id": "ugly-duckling",
    "title": "The Ugly Duckling",
    "author": "Hans Christian Andersen",
    "source": "curated",
    "content": "On a beautiful summer day, a mother duck sat on her nest waiting for her eggs to hatch. One by one, fluffy yellow ducklings popped out. But the last egg was bigger than the rest, and when it finally cracked open, out tumbled a large, gray bird.\n\n\"My, you are different,\" said the mother duck kindly. But the other ducklings weren't so nice. \"You're ugly!\" they quacked. The farmyard animals teased him too. The hens pecked at him, and the turkey gobbled rudely.\n\nThe poor duckling felt so sad that he ran away. He wandered through marshes and meadows, looking for someone who would be his friend. Winter came, and the duckling nearly froze in an icy pond. A kind farmer found him and brought him home to warm up.\n\nBut the duckling was clumsy indoors and accidentally knocked over the milk pail, so he ran away again. Through the long, cold winter he survived alone, always feeling lonely and different.\n\nWhen spring finally arrived, the duckling saw three beautiful white birds gliding across a lake. They were the most graceful creatures he had ever seen. \"I wish I could be like them,\" he sighed, and he swam toward them, expecting to be chased away.\n\nBut when he looked at his reflection in the water, he gasped. He was no longer a clumsy gray bird. He had grown into a beautiful white swan! The other swans welcomed him warmly.\n\nChildren on the shore pointed and said, \"Look at the new swan! He's the most beautiful of all!\" The young swan tucked his head shyly, his heart full of joy. He had never dreamed of so much happiness when he was the ugly duckling.",
    "summary": "A duckling who is teased for being different discovers he is actually a beautiful swan.",
    "length": "medium",
    "mood": ["calming", "educational"],
    "themes": ["animals", "nature", "friendship"],
    "readingTimeMinutes": 5,
    "coverEmoji": "🦢"
  },
  {
    "id": "three-little-pigs",
    "title": "The Three Little Pigs",
    "author": "Traditional Folk Tale",
    "source": "curated",
    "content": "Once upon a time, three little pigs set out to build their own houses.\n\nThe first little pig was in a hurry to play, so he built his house out of straw. \"Done!\" he squealed happily, and he spent the rest of the day splashing in mud puddles.\n\nThe second little pig wanted to finish quickly too, so he built his house out of sticks. \"Good enough!\" he said, and he went off to chase butterflies.\n\nThe third little pig took her time. She mixed cement, laid bricks one by one, and built a strong house with a sturdy chimney. \"Safety first,\" she said with a smile.\n\nOne evening, a big bad wolf came prowling through the neighborhood. He spotted the first pig's straw house and knocked on the door. \"Little pig, little pig, let me come in!\"\n\n\"Not by the hair on my chinny chin chin!\" squeaked the pig.\n\n\"Then I'll huff and I'll puff and I'll blow your house down!\" And the wolf blew the straw house to pieces! The first pig ran to his brother's house.\n\nThe wolf followed and knocked on the stick house door. \"Little pigs, little pigs, let me come in!\"\n\n\"Not by the hair on our chinny chin chins!\"\n\n\"Then I'll huff and I'll puff and I'll blow your house down!\" And with two big breaths, the stick house tumbled down! Both pigs ran to their sister's brick house.\n\nThe wolf huffed and puffed at the brick house, but it didn't budge. He huffed and puffed again—nothing! He tried to climb down the chimney, but the clever third pig had lit a fire, and the wolf scrambled back up and ran away, never to return.\n\nThe three little pigs celebrated with a big dinner. The first two pigs learned an important lesson: it's worth taking the time to do things right.",
    "summary": "Three pigs build houses of different materials and learn the value of hard work.",
    "length": "medium",
    "mood": ["adventure", "funny"],
    "themes": ["animals"],
    "readingTimeMinutes": 4,
    "coverEmoji": "🐷"
  },
  {
    "id": "peter-rabbit",
    "title": "The Tale of Peter Rabbit",
    "author": "Beatrix Potter",
    "source": "curated",
    "content": "Once upon a time there were four little rabbits, and their names were Flopsy, Mopsy, Cotton-tail, and Peter. They lived with their mother in a sand-bank underneath the root of a very big fir tree.\n\n\"Now, my dears,\" said old Mrs. Rabbit one morning, \"you may go into the fields or down the lane, but don't go into Mr. McGregor's garden. Your father had an accident there.\"\n\nFlopsy, Mopsy, and Cotton-tail, who were good little bunnies, went down the lane to gather blackberries. But Peter, who was very naughty, ran straight away to Mr. McGregor's garden and squeezed under the gate!\n\nFirst he ate some lettuces and some French beans, and then he ate some radishes. And then, feeling rather sick, he went to look for some parsley. But whom should he meet around the end of a cucumber frame? Mr. McGregor!\n\nMr. McGregor was on his hands and knees planting out young cabbages, but he jumped up and ran after Peter, waving a rake and calling out, \"Stop thief!\"\n\nPeter was most dreadfully frightened. He rushed all over the garden, for he had forgotten the way back to the gate. He lost one of his shoes among the cabbages and the other shoe amongst the potatoes. After losing them, he ran on four legs and went faster.\n\nHe might have gotten away altogether if he had not run into a gooseberry net and gotten caught by the large buttons on his jacket. Peter gave himself up for lost and shed big tears. But his sobs were overheard by some friendly sparrows, who flew to him and implored him to exert himself.\n\nPeter wriggled out just in time, leaving his jacket behind. He rushed into the tool-shed and jumped into a watering can. It would have been a beautiful thing to hide in, if it had not had so much cold water in it.\n\nMr. McGregor was sure that Peter was somewhere in the tool-shed, but Peter sneezed—\"Kertyschoo!\"—and Mr. McGregor was after him in no time. Peter jumped out of a window, upsetting three plants.\n\nAfter wandering around, Peter found the gate at last! He slipped underneath and ran home to the big fir tree. His mother wondered what he had done with his clothes. It was the second little jacket and pair of shoes that Peter had lost in a fortnight!\n\nPeter was not very well during the evening. His mother put him to bed and made him some chamomile tea. But Flopsy, Mopsy, and Cotton-tail had bread and milk and blackberries for supper.",
    "summary": "A naughty little rabbit sneaks into a farmer's garden and has a thrilling escape.",
    "length": "medium",
    "mood": ["adventure", "funny"],
    "themes": ["animals", "nature"],
    "readingTimeMinutes": 5,
    "coverEmoji": "🐰"
  },
  {
    "id": "lion-mouse",
    "title": "The Lion and the Mouse",
    "author": "Aesop",
    "source": "curated",
    "content": "One hot afternoon, a mighty Lion was sleeping peacefully in the shade when a little Mouse accidentally ran across his nose.\n\nThe Lion woke up with a ROAR and caught the tiny Mouse in his huge paw. \"How dare you wake me up!\" he growled. \"I shall eat you for my trouble!\"\n\n\"Oh please, great Lion!\" squeaked the Mouse. \"Please let me go! If you spare my life, I promise I will help you someday.\"\n\nThe Lion laughed so hard that his mane shook. \"You? Help ME? That's the funniest thing I've ever heard!\" But the Lion was in a good mood, so he opened his paw and let the little Mouse go.\n\nSome days later, the Lion was walking through the forest when he stepped into a hunter's trap. A heavy net fell over him, and no matter how hard he struggled, he could not break free. He roared in anger and frustration, and his roars echoed through the trees.\n\nThe little Mouse heard the Lion's cries and came running. When she saw the Lion tangled in the net, she said, \"Don't worry, dear Lion! I will save you!\"\n\nThe Mouse began gnawing at the ropes with her tiny, sharp teeth. She chewed and chewed, and one by one, the ropes snapped. Before long, the Lion was free!\n\n\"Thank you, little Mouse,\" said the Lion humbly. \"I was wrong to laugh at you. You really did help me, just as you promised.\"\n\nThe Mouse smiled. \"Even the smallest friend can be the greatest help.\"\n\nFrom that day on, the Lion and the Mouse were the best of friends, proving that kindness is never wasted, no matter how small the creature.",
    "summary": "A tiny mouse proves that even the smallest friends can make the biggest difference.",
    "length": "short",
    "mood": ["educational", "calming"],
    "themes": ["animals", "friendship"],
    "readingTimeMinutes": 3,
    "coverEmoji": "🦁"
  },
  {
    "id": "star-money",
    "title": "The Star Money",
    "author": "Brothers Grimm",
    "source": "curated",
    "content": "Once upon a time, there was a little girl whose parents had passed away, leaving her all alone in the world. She had no house to live in, no bed to sleep in, and nothing left but the clothes on her back and a small piece of bread that a kind neighbor had given her.\n\nBut the little girl was good and trusting, and she believed that things would work out. So she walked out into the countryside, putting her faith in the world.\n\nShe had not gone far when she met a poor man who said, \"Please give me something to eat. I am so hungry.\" The little girl gave him her entire piece of bread and said, \"Here, take this. I hope it helps you.\" And she walked on.\n\nNext, she met a child who was crying. \"My head is so cold,\" the child whimpered. \"I have no hat.\" So the little girl took off her own hat and gave it to the child.\n\nShe walked a little further and met another child who had no coat and was shivering. The little girl gave away her coat. And then she met another who needed her dress, and she gave that away too.\n\nAt last, when it was dark and she had entered a forest, she met one more child who asked for her undershirt. The good little girl thought, \"It is dark night and no one can see me, so I can give away my shirt too.\" And she did.\n\nAs she stood there with nothing left at all, suddenly stars began falling from the sky. But they were not ordinary stars—as they touched the ground, they turned into shining silver coins! And she found herself wearing a new dress made of the finest cloth.\n\nThe little girl gathered up all the star money and was rich for the rest of her life. And because she had been so generous when she had nothing, she grew up to be generous when she had everything.",
    "summary": "A generous orphan girl gives away everything she has and is rewarded with stars that turn to silver.",
    "length": "short",
    "mood": ["calming", "educational"],
    "themes": ["nature", "friendship"],
    "readingTimeMinutes": 3,
    "coverEmoji": "⭐"
  },
  {
    "id": "bremen-musicians",
    "title": "The Bremen Town Musicians",
    "author": "Brothers Grimm",
    "source": "curated",
    "content": "A donkey who had worked hard his whole life carrying heavy sacks of grain learned that his owner planned to get rid of him because he was getting old. \"I may be old, but I can still sing!\" said the Donkey. \"I'll go to Bremen and become a town musician!\"\n\nOn the road, the Donkey met a Dog lying by the side of the road, panting heavily. \"What's the matter?\" asked the Donkey.\n\n\"My master says I'm too old to hunt,\" sighed the Dog. \"I don't know what to do.\"\n\n\"Come with me to Bremen!\" said the Donkey. \"You can play the drums, and I'll play the guitar!\" The Dog wagged his tail and joined him.\n\nFurther along, they found a Cat sitting by a fence, looking miserable. \"My mistress wants to get rid of me because I'd rather sit by the fire than chase mice,\" the Cat meowed sadly.\n\n\"Join us!\" said the Donkey. \"You can sing in our band!\" The Cat purred and came along.\n\nBefore long, they passed a farm where a Rooster was crowing with all his might from a fencepost. \"Why are you crowing so loudly?\" they asked.\n\n\"The farmer's wife says she'll put me in Sunday's soup!\" cried the Rooster. \"So I'm crowing while I still can!\"\n\n\"Don't be soup—be a singer!\" said the Donkey. \"Come to Bremen with us!\" And so the four friends set off together.\n\nAs night fell, they came to a cottage in the woods. Through the window, they could see a table loaded with delicious food, but the cottage was full of robbers!\n\nThe four friends came up with a plan. The Dog climbed on the Donkey's back, the Cat climbed on the Dog, and the Rooster perched on top of the Cat. Then, all together, they made their music: the Donkey brayed, the Dog barked, the Cat meowed, and the Rooster crowed!\n\nThe noise was so tremendous and terrifying that the robbers thought a monster was attacking! They ran out of the cottage as fast as their legs could carry them, screaming in fear.\n\nThe four musicians went inside, ate the wonderful meal, and settled down for the night. When the robbers sent one of their men back to check on the cottage, the Cat scratched his face, the Dog bit his leg, the Donkey kicked him, and the Rooster crowed \"Cock-a-doodle-doo!\" from the rooftop.\n\nThe robber ran back to his friends, terrified. \"There's a witch who scratched me, a man with a knife, a monster who hit me with a club, and a judge on the roof shouting 'Bring the crook to me!'\"\n\nThe robbers never came back. And the four friends liked the cottage so much that they never went to Bremen after all. They lived there happily, making their music every day.",
    "summary": "Four aging animals band together and outsmart a group of robbers with their 'music.'",
    "length": "long",
    "mood": ["funny", "adventure"],
    "themes": ["animals", "music", "friendship"],
    "readingTimeMinutes": 7,
    "coverEmoji": "🎶"
  },
  {
    "id": "thumbelina",
    "title": "Thumbelina",
    "author": "Hans Christian Andersen",
    "source": "curated",
    "content": "Once upon a time, a woman wished for a tiny child. A kind fairy gave her a magical seed, and from it grew a beautiful flower. When the petals opened, there sat a girl no bigger than a thumb! The woman named her Thumbelina.\n\nThumbelina slept in a walnut shell with a rose petal blanket and sang with the sweetest voice in the world. But one night, a big ugly toad crept through the window and carried Thumbelina away.\n\n\"My son needs a wife!\" croaked the toad, and she left Thumbelina on a lily pad in the middle of a stream. Poor Thumbelina cried and cried. The little fish in the stream felt sorry for her and nibbled through the lily pad's stem so it floated away from the toads.\n\nThe lily pad carried Thumbelina down the stream. A beautiful white butterfly flew alongside her, and Thumbelina tied her ribbon to the butterfly so it could pull her along. It was almost like sailing!\n\nBut then a large beetle snatched Thumbelina and carried her to his tree. The other beetles looked at her and said, \"She only has two legs! She has no antennae! How ugly!\" The beetle didn't want her anymore and set her down in a meadow.\n\nAll summer long, Thumbelina lived among the flowers, drinking nectar and singing to the birds. But when winter came, the flowers died, and the big leaves that sheltered her withered away. She was cold and hungry.\n\nA kind field mouse found Thumbelina shivering at her door. \"Come inside, dear child,\" said the mouse. \"You can stay with me if you help keep my house clean and tell me stories.\" Thumbelina was grateful and told the field mouse wonderful stories every evening.\n\nThe field mouse's neighbor, a rich mole, heard Thumbelina's stories and fell in love with her voice. \"You should marry the mole,\" said the field mouse. \"He has a fine house and plenty of food.\"\n\nBut the mole's tunnel was dark and cold, and he hated sunshine and flowers. In his tunnel, Thumbelina found a swallow who had fallen ill. She secretly nursed the bird back to health all winter, bringing it food and wrapping it in a blanket of grass.\n\nWhen spring came, the swallow was well again. \"Come fly away with me, dear Thumbelina!\" he said. Thumbelina climbed on the swallow's back, and they flew over mountains and valleys to a warm land full of sunshine and flowers.\n\nThe swallow set Thumbelina down in a beautiful white flower. And there inside the flower stood a tiny prince with sparkly wings, no bigger than Thumbelina herself! He was the king of the flower fairies.\n\n\"Will you be my friend and live among the flowers?\" he asked. Thumbelina's heart filled with joy. She had finally found where she belonged—a world just her size, full of sunshine, flowers, and friends.\n\nThe flower fairies gave her a pair of lovely wings, and she flew from flower to flower, singing her beautiful songs. And the swallow sat in his nest nearby, singing along with her.",
    "summary": "A tiny girl no bigger than a thumb goes on a grand journey to find where she truly belongs.",
    "length": "long",
    "mood": ["adventure", "calming"],
    "themes": ["nature", "animals", "fantasy"],
    "readingTimeMinutes": 8,
    "coverEmoji": "🌷"
  },
  {
    "id": "ant-grasshopper",
    "title": "The Ant and the Grasshopper",
    "author": "Aesop",
    "source": "curated",
    "content": "On a warm summer day, a Grasshopper sat on a tall blade of grass, playing his fiddle and singing merry songs. The sun was shining, flowers were blooming, and the Grasshopper didn't have a care in the world.\n\nNearby, a long line of Ants marched past, each carrying a heavy piece of food on their backs. They were working hard, collecting grain and seeds and storing them in their underground home.\n\n\"Why do you work so hard on such a beautiful day?\" called the Grasshopper. \"Come and sing with me instead!\"\n\n\"We're storing food for the winter,\" said one of the Ants, wiping her brow. \"You should do the same, Grasshopper.\"\n\n\"Winter?\" laughed the Grasshopper. \"Winter is ages away! There's plenty of food everywhere. Why worry about tomorrow when today is so wonderful?\" And he went back to playing his fiddle.\n\nThe Ants shook their heads and kept on working. All through summer and autumn, they gathered food while the Grasshopper sang and danced and played.\n\nThen winter arrived. The ground froze solid. Snow covered everything. The Grasshopper searched everywhere but could not find a single seed or grain to eat. Cold and starving, he knocked on the Ants' door.\n\n\"Please,\" he shivered, \"could you spare some food? I'm so hungry.\"\n\nThe Ants looked at each other. They could have turned him away, but instead they opened their door. \"Come in,\" they said. \"We have enough to share.\"\n\nAs the Grasshopper warmed himself by the Ants' fire and ate their food, he said, \"I understand now. You were wise to prepare while I was foolish to play. Next summer, I promise I'll work alongside you.\"\n\n\"And perhaps,\" said the Ant with a smile, \"you can play your fiddle for us in the evenings. Work is important, but so is a little music.\"\n\nThe Grasshopper smiled. From then on, he worked in the summer and played his fiddle in the evenings, and everyone was happy.",
    "summary": "A musical grasshopper learns the value of planning ahead from his industrious ant neighbors.",
    "length": "short",
    "mood": ["educational", "calming"],
    "themes": ["animals", "music", "friendship"],
    "readingTimeMinutes": 3,
    "coverEmoji": "🦗"
  },
  {
    "id": "little-prince-rose",
    "title": "The Little Prince and His Rose",
    "author": "Antoine de Saint-Exupéry (adapted)",
    "source": "curated",
    "content": "On a tiny planet, no bigger than a house, lived a Little Prince. His planet had three volcanoes (two active and one extinct) and a few baobab seedlings that he carefully pulled up each morning so they wouldn't grow too big.\n\nOne day, a seed that had blown from far away began to sprout. The Little Prince watched it carefully—this was no baobab. It grew into a beautiful rose with four lovely petals.\n\n\"How beautiful you are!\" said the Little Prince.\n\n\"Yes, I am rather wonderful,\" said the Rose, who was quite vain. \"I'd like some water, please, and a glass dome to protect me from drafts.\"\n\nThe Little Prince cared for the Rose faithfully. He watered her every day, shielded her from the wind, and listened to her when she complained. But sometimes the Rose was difficult. She would cough dramatically and say, \"I'm fragile, you know,\" even though she was actually quite strong.\n\nThe Little Prince began to feel sad. \"She tells me she's the only rose in the universe,\" he thought. \"But she makes me feel confused with her contradictions.\"\n\nSo the Little Prince decided to explore other planets. He visited several strange worlds. On one, a king ruled over nothing. On another, a vain man wanted only applause. On a third, a lamplighter endlessly lit and extinguished a street lamp. Each planet seemed rather odd.\n\nFinally, the Little Prince came to Earth. He walked through a desert, climbed a mountain, and found a garden full of roses—thousands of them! They all looked just like his rose.\n\n\"I thought she was the only one,\" he whispered, and he felt very sad.\n\nBut then he met a wise fox. \"Tame me,\" said the fox. \"Then I will be special to you, and you will be special to me.\"\n\nThe Little Prince began to understand. He visited with the fox every day, and they became friends. When it was time to say goodbye, the fox told him a secret: \"It is only with the heart that one can see rightly. What is essential is invisible to the eye.\"\n\nThe Little Prince returned to the garden of roses. \"You are beautiful, but you are empty,\" he told them. \"My rose is more important than all of you, because she is the one I watered. Because she is the one I listened to. Because she is MY rose.\"\n\nAnd the Little Prince understood at last that what made his rose special was not that she was unique in the world, but that he had loved her and cared for her. That is what made her his.",
    "summary": "A Little Prince travels the universe and learns that love and care make things truly special.",
    "length": "long",
    "mood": ["calming", "educational"],
    "themes": ["space", "nature", "friendship"],
    "readingTimeMinutes": 7,
    "coverEmoji": "🌹"
  },
  {
    "id": "owl-pussycat",
    "title": "The Owl and the Pussycat",
    "author": "Edward Lear",
    "source": "curated",
    "content": "The Owl and the Pussycat went to sea\nIn a beautiful pea-green boat.\nThey took some honey, and plenty of money\nWrapped up in a five-pound note.\n\nThe Owl looked up to the stars above,\nAnd sang to a small guitar,\n\"O lovely Pussy, O Pussy my love,\nWhat a beautiful Pussy you are, you are,\nWhat a beautiful Pussy you are!\"\n\nPussy said to the Owl, \"You elegant fowl,\nHow charmingly sweet you sing!\nOh! Let us be married; too long we have tarried;\nBut what shall we do for a ring?\"\n\nThey sailed away, for a year and a day,\nTo the land where the bong-tree grows.\nAnd there in a wood a Piggy-wig stood,\nWith a ring at the end of his nose, his nose,\nWith a ring at the end of his nose.\n\n\"Dear Pig, are you willing to sell for one shilling\nYour ring?\" Said the Piggy, \"I will.\"\nSo they took it away, and were married next day\nBy the Turkey who lives on the hill.\n\nThey dined on mince and slices of quince,\nWhich they ate with a runcible spoon;\nAnd hand in hand, on the edge of the sand,\nThey danced by the light of the moon, the moon,\nThey danced by the light of the moon.",
    "summary": "A whimsical poem about an owl and a cat who sail away on an adventure together.",
    "length": "short",
    "mood": ["funny", "calming"],
    "themes": ["animals", "nature", "music"],
    "readingTimeMinutes": 2,
    "coverEmoji": "🦉"
  },
  {
    "id": "jack-beanstalk",
    "title": "Jack and the Beanstalk",
    "author": "Traditional Folk Tale",
    "source": "curated",
    "content": "Once upon a time, a boy named Jack lived with his mother in a small cottage. They were very poor, and one day his mother said, \"Jack, we must sell our cow Milky-White. She gives no more milk, and we need money for food.\"\n\nSo Jack took Milky-White to market. On the way, he met a strange old man. \"I'll give you these magic beans for your cow,\" said the man, holding out five colorful beans.\n\nJack thought they looked wonderful and traded the cow for the beans. But when he got home, his mother was furious! \"Magic beans? You silly boy!\" She threw the beans out the window and sent Jack to bed without supper.\n\nWhen Jack woke the next morning, his room was dark. He looked out the window and gasped. A gigantic beanstalk had grown overnight, stretching up through the clouds and out of sight!\n\nJack began to climb. Up and up he went, past the clouds, until he reached a land high in the sky. Before him stood an enormous castle. Jack crept inside and found a kitchen bigger than his whole village.\n\nSuddenly, the ground shook. BOOM. BOOM. BOOM. A giant stomped in!\n\n\"Fee-fi-fo-fum!\" roared the Giant. Jack quickly hid inside a teapot. The Giant sat down to eat an enormous breakfast, then counted golden coins before falling asleep.\n\nWhile the Giant snored, Jack grabbed a bag of gold coins and climbed back down the beanstalk as fast as he could. His mother was overjoyed!\n\nThe gold lasted a long time, but eventually it ran out. So Jack climbed the beanstalk again. This time, he found a hen that laid golden eggs! He tucked the hen under his arm and hurried down.\n\nBut Jack was curious, and he climbed the beanstalk one more time. This time, he found a magical golden harp that played beautiful music all by itself. But when Jack picked it up, the harp cried, \"Master! Master!\"\n\nThe Giant woke up with a terrible roar and chased Jack to the beanstalk. Jack slid down so fast his hands burned. \"Mother, bring the axe!\" he shouted.\n\nAs the Giant started climbing down, Jack chopped at the beanstalk with all his might. CHOP! CHOP! CHOP! The beanstalk came crashing down, and the Giant tumbled far, far away, never to be seen again.\n\nJack and his mother lived happily ever after, with their golden eggs and their magical harp that played sweet lullabies every night.",
    "summary": "A boy trades his cow for magic beans and discovers a giant's castle in the clouds.",
    "length": "long",
    "mood": ["adventure"],
    "themes": ["fantasy", "nature"],
    "readingTimeMinutes": 7,
    "coverEmoji": "🫘"
  },
  {
    "id": "golden-fish",
    "title": "The Golden Fish",
    "author": "Alexander Pushkin (adapted)",
    "source": "curated",
    "content": "An old fisherman and his wife lived in a tiny hut by the sea. Every day, the fisherman went out in his boat to catch fish.\n\nOne day, he caught a beautiful golden fish in his net. To his amazement, the fish spoke! \"Please let me go, kind fisherman! I will grant you any wish.\"\n\nThe kind fisherman said, \"I don't need anything, little fish. Go, swim free.\" And he gently put the golden fish back in the sea.\n\nWhen he told his wife what had happened, she was angry. \"You old fool! At least you could have asked for a new washtub! Ours is falling apart. Go back and ask!\"\n\nSo the fisherman went to the sea and called for the golden fish. The fish appeared and said, \"What do you need, old man?\" The fisherman asked for a new washtub, and when he got home, there was a shiny new washtub waiting.\n\nBut his wife wanted more. \"Go back and ask for a nice cottage!\" The fisherman went back, and the golden fish gave them a lovely cottage with a garden. But the wife still wasn't satisfied.\n\n\"I want to be a queen!\" she demanded. The fisherman, his heart heavy, went back to the sea, which had turned gray and choppy. The golden fish granted the wish, and suddenly his wife sat on a golden throne in a magnificent palace.\n\nBut even that wasn't enough. \"I want to be the ruler of the sea itself!\" commanded the wife. \"I want the golden fish to serve ME!\"\n\nThe fisherman went to the sea one last time. The sky was dark, and the waves crashed angrily. He called for the golden fish and told it his wife's demand.\n\nThe golden fish looked at him sadly, swished its tail, and disappeared beneath the waves without a word.\n\nWhen the fisherman returned home, the palace was gone. The throne was gone. His wife sat in front of their old hut, with the same broken washtub at her feet.\n\nAnd so it was that greed took away everything, leaving them right where they had started.",
    "summary": "A magical fish grants wishes, but greed leads to losing everything.",
    "length": "medium",
    "mood": ["educational", "calming"],
    "themes": ["nature", "animals"],
    "readingTimeMinutes": 5,
    "coverEmoji": "🐟"
  },
  {
    "id": "elves-shoemaker",
    "title": "The Elves and the Shoemaker",
    "author": "Brothers Grimm",
    "source": "curated",
    "content": "A shoemaker had become so poor that he had only enough leather to make one last pair of shoes. That evening, he carefully cut out the leather and left it on his workbench, planning to sew the shoes in the morning.\n\nWhen he woke up, he could not believe his eyes! There on the bench sat a perfect pair of shoes, beautifully stitched with tiny, perfect stitches. He had never seen such fine work!\n\nA customer came in and loved the shoes so much that she paid a very good price for them. With the money, the shoemaker bought enough leather for two pairs of shoes. He cut out the leather that evening and went to bed.\n\nIn the morning, there were two beautiful pairs of shoes waiting for him! Again, the stitches were tiny and perfect. He sold both pairs for a handsome price and bought leather for four pairs.\n\nThis went on for weeks. Every night, the shoemaker cut out the leather, and every morning, beautiful finished shoes appeared. Soon the shoemaker and his wife were doing well again.\n\nOne evening near Christmas, the shoemaker's wife said, \"Let's stay up tonight and see who's been helping us.\" They hid behind a curtain and waited.\n\nAt midnight, two tiny elves hopped onto the workbench! They were naked as could be, with no clothes at all. Their little fingers flew as they stitched and hammered and polished. By dawn, the shoes were done, and the elves scurried away.\n\n\"Those little elves have been so kind!\" said the wife. \"They must be freezing with no clothes. Let's make them something to wear!\"\n\nThe wife sewed two tiny outfits with little green jackets, red pants, and matching caps. The shoemaker made two pairs of tiny shoes. That evening, they left the clothes on the workbench instead of leather.\n\nAt midnight, the elves appeared. When they saw the little outfits, they squealed with delight! They dressed up, admired themselves, and danced around the workshop singing:\n\n\"Now we're dressed so fine and neat,\nNo more cobbling shoes for feet!\"\n\nAnd with that, they danced out the door and were never seen again. But the shoemaker and his wife continued to prosper, and they never forgot the kindness of the little elves.",
    "summary": "Mysterious tiny elves secretly help a poor shoemaker, and he repays their kindness.",
    "length": "medium",
    "mood": ["calming", "funny"],
    "themes": ["fantasy", "friendship"],
    "readingTimeMinutes": 5,
    "coverEmoji": "👞"
  },
  {
    "id": "how-camel-got-hump",
    "title": "How the Camel Got His Hump",
    "author": "Rudyard Kipling (adapted)",
    "source": "curated",
    "content": "In the very beginning, when the world was brand new, all the animals had to work to help things get started. The Horse pulled carts, the Dog fetched and carried, and the Ox ploughed the fields.\n\nBut the Camel lived in the middle of a desert and didn't want to work at all. When anyone asked him to help, he just said \"Humph!\" and went back to eating prickly plants.\n\nThe Horse came to him and said, \"Camel, come and trot like the rest of us.\"\n\n\"Humph!\" said the Camel.\n\nThe Dog came and said, \"Camel, come and fetch and carry like the rest of us.\"\n\n\"Humph!\" said the Camel.\n\nThe Ox came and said, \"Camel, come and plough like the rest of us.\"\n\n\"Humph!\" said the Camel.\n\nThe three animals were very cross. Because the Camel wouldn't work, they had to do extra work themselves. They went to complain to the Djinn, the magical spirit who was in charge of the desert.\n\n\"That Camel in the desert won't do any work,\" they said. \"He just says 'Humph!' to everything.\"\n\nThe Djinn went to find the Camel, who was looking at his own reflection in a pool of water, as usual.\n\n\"I hear you've been saying 'Humph' instead of working,\" said the Djinn.\n\n\"Humph!\" said the Camel.\n\n\"I wouldn't say that again if I were you,\" warned the Djinn.\n\n\"HUMPH!\" said the Camel.\n\nNo sooner had he said it than his back began to puff up and up and up, until a great big HUMP sat right in the middle of it!\n\n\"That's the hump you've given yourself by saying 'Humph' so much,\" said the Djinn. \"Now you can work for three days without eating or drinking, because you can live off the food and water stored in your hump. No more excuses!\"\n\nAnd so the Camel had to go out and work with the other animals. But he never did quite catch up on all the days he had missed at the beginning of the world.\n\nAnd that is how the Camel got his hump. Not a pretty hump, mind you, but a humph—because he was too lazy and said 'Humph!' too often.",
    "summary": "A lazy camel who refuses to work gets a magical hump as a consequence.",
    "length": "medium",
    "mood": ["funny", "educational"],
    "themes": ["animals", "nature"],
    "readingTimeMinutes": 5,
    "coverEmoji": "🐫"
  },
  {
    "id": "velveteen-rabbit",
    "title": "The Velveteen Rabbit",
    "author": "Margery Williams (adapted)",
    "source": "curated",
    "content": "There was once a velveteen rabbit, and in the beginning he was really splendid. He was fat and bunchy, as a rabbit should be. His coat was spotted brown and white, he had real thread whiskers, and his ears were lined with pink sateen.\n\nOn Christmas morning, he sat in the top of the Boy's stocking, with a sprig of holly between his paws. The Boy loved him for at least two hours, but then the other presents were opened, and the Rabbit was forgotten.\n\nFor a long time, the Rabbit lived in the toy cupboard. The mechanical toys were very superior and looked down on him. \"I can do a backflip,\" said the tin soldier. \"I have moving parts,\" said the model engine.\n\nOnly the old Skin Horse, who had been in the nursery for years and years, was kind to him. One evening, the Rabbit asked, \"What is Real? Does it mean having things that buzz inside you?\"\n\n\"Real isn't how you are made,\" said the Skin Horse. \"It's a thing that happens to you. When a child loves you for a long, long time, not just to play with, but REALLY loves you, then you become Real.\"\n\n\"Does it hurt?\" asked the Rabbit.\n\n\"Sometimes,\" said the Skin Horse, for he was always truthful. \"But when you are Real, you don't mind being hurt.\"\n\n\"Does it happen all at once?\" he asked.\n\n\"It doesn't happen all at once. You become. It takes a long time. That's why it doesn't often happen to people who break easily, or have sharp edges, or who have to be carefully kept. Generally, by the time you are Real, most of your hair has been loved off, and your eyes drop out, and you get loose in the joints and very shabby. But these things don't matter at all, because once you are Real, you can't be ugly, except to people who don't understand.\"\n\nOne night, the Boy couldn't find his china dog to sleep with, and Nana grabbed the Rabbit and put him in the Boy's arms. From that night on, the Velveteen Rabbit slept with the Boy. The Boy took him everywhere—to the garden, on picnics, even building him little nests out of grass.\n\nSpring came, and the Rabbit went with the Boy everywhere. His velveteen fur got shabbier and shabbier, but the Boy loved him just the same. And one magical day, when the Boy said, \"You are Real,\" the Rabbit knew it was true.\n\nHe was Real. Not real because of his whiskers or his brown spots, but real because he was loved. And that was the best kind of real there was.",
    "summary": "A toy rabbit discovers what it means to become Real through a child's love.",
    "length": "long",
    "mood": ["calming", "educational"],
    "themes": ["friendship", "fantasy"],
    "readingTimeMinutes": 7,
    "coverEmoji": "🧸"
  },
  {
    "id": "north-wind-sun",
    "title": "The North Wind and the Sun",
    "author": "Aesop",
    "source": "curated",
    "content": "The North Wind and the Sun were having an argument about who was stronger.\n\n\"I am the mightiest force in the world!\" howled the North Wind, rattling windows and bending trees. \"Nothing can withstand my power!\"\n\n\"Strength isn't just about force,\" said the Sun gently, glowing warm and golden.\n\nJust then, a traveler came walking down the road, wrapped in a thick winter cloak. \"Let's settle this,\" said the Sun. \"Whoever can make that traveler take off his cloak shall be called the stronger.\"\n\n\"Easy!\" boasted the North Wind. He took a deep breath and BLEW with all his might! The wind howled and swirled around the traveler, pulling at his cloak. But the harder the Wind blew, the tighter the traveler wrapped his cloak around himself.\n\nThe North Wind blew harder and harder—fierce gusts that bent trees and sent leaves flying. But the traveler just hunched down, gripped his cloak, and kept walking, wrapped up tighter than ever.\n\nFinally, the North Wind was exhausted and gave up.\n\nThen the Sun began to shine. She sent down gentle, warm rays. The traveler loosened his cloak a little. The Sun shone a bit warmer, and the traveler unbuttoned his cloak. The Sun made the day bright and lovely, and the traveler wiped his brow and took his cloak off entirely, sitting down under a tree to enjoy the beautiful weather.\n\n\"You see,\" said the Sun with a smile, \"gentleness and warmth can accomplish what force and fury cannot.\"\n\nThe North Wind had to agree. Sometimes the quiet, kind approach is far more powerful than all the bluster in the world.",
    "summary": "The Sun and North Wind compete to make a traveler remove his cloak, teaching that gentleness wins.",
    "length": "short",
    "mood": ["educational", "calming"],
    "themes": ["nature"],
    "readingTimeMinutes": 2,
    "coverEmoji": "☀️"
  },
  {
    "id": "pied-piper",
    "title": "The Pied Piper of Hamelin",
    "author": "Robert Browning (adapted)",
    "source": "curated",
    "content": "Long ago, the town of Hamelin had a terrible problem: rats! Rats in the kitchens, rats in the bedrooms, rats in the hats and rats in the cradles. Rats everywhere! The people begged the Mayor to do something.\n\nOne day, a tall, thin stranger appeared at the town gates. He wore a coat of many colors—half yellow and half red—and he carried a silver pipe. \"I am the Pied Piper,\" he said. \"For a thousand guilders, I will rid your town of every single rat.\"\n\n\"A thousand guilders? We'd pay fifty thousand!\" cried the Mayor. \"Just get rid of the rats!\"\n\nThe Piper lifted his pipe to his lips and began to play a strange, sweet melody. And from every house and shop, from every cellar and attic, the rats came pouring out! Big rats, small rats, lean rats, fat rats, old rats, young rats—they all followed the Piper's music.\n\nHe walked through the streets playing his pipe, and the rats danced and scurried behind him in a great flood. He led them down to the river, and every single rat jumped in and was swept away. Hamelin was free!\n\nBut when the Piper came to collect his thousand guilders, the Mayor laughed. \"A thousand guilders? For playing a silly tune? Here's fifty guilders, and be grateful for that!\"\n\nThe Piper's face turned serious. \"You made a promise,\" he said quietly. \"I would think carefully before breaking it.\"\n\n\"Bah!\" said the Mayor. \"What can a musician do to us? We're not afraid of a pipe!\"\n\nThe Piper said nothing. He simply raised his pipe and played a different tune—a melody so magical and joyful that every child in Hamelin came running. They laughed and danced and followed the music through the streets.\n\nThe Piper led the children to a hill outside of town. A magical doorway opened in the hillside, and the children danced inside, into a beautiful land where the sun always shone and trees bore candy and every day was a holiday.\n\nThe doorway closed behind them. Only one child was left behind—a boy who couldn't keep up because of a hurt leg. He told the townspeople about the wonderful land the Piper had shown them.\n\nThe Mayor and the people of Hamelin searched and searched, but they never found their children. And from that day on, the people of Hamelin always kept their promises.\n\nThe lesson was clear: a promise made should always be a promise kept.",
    "summary": "A magical musician rids a town of rats, but when the town breaks its promise, they pay a steep price.",
    "length": "long",
    "mood": ["adventure", "educational"],
    "themes": ["music", "fantasy"],
    "readingTimeMinutes": 6,
    "coverEmoji": "🎵"
  },
  {
    "id": "why-sky-far-away",
    "title": "Why the Sky Is Far Away",
    "author": "Nigerian Folk Tale",
    "source": "curated",
    "content": "Long, long ago, the sky was very close to the earth. So close that you could reach up and tear off a piece! And the sky was delicious—it tasted like honey and mangoes and fresh bread all at once. People never had to farm or cook. Whenever they were hungry, they just reached up and took a piece of the sky.\n\nBut the sky had one rule: \"Take only what you need. Never waste me.\"\n\nFor a long time, people followed this rule. They took just enough sky to fill their bellies and were happy. But as time passed, some people got greedy. They would tear off huge pieces of sky, eat a little, and throw the rest away.\n\nThe sky grew angry. \"People are wasting me!\" the sky rumbled. \"If they don't stop, I will move far away.\"\n\nThe King heard the sky's warning and told everyone, \"Be careful! Only take what you can eat!\" For a while, people listened.\n\nThen came a great festival. A woman named Adese wanted to show off, so she tore down an enormous piece of sky—more than ten people could eat. She ate some, gave some to her husband, gave some to her children, and offered some to her neighbors. But there was still so much left over!\n\n\"Please, someone eat this!\" she begged. But no one was hungry. She tried to hide the leftover sky in the garbage, hoping no one would notice.\n\nBut the sky noticed. The sky ALWAYS noticed.\n\nDark clouds gathered. Thunder crashed. The sky began to rise, higher and higher, pulling away from the earth.\n\n\"Wait!\" cried the people. \"We're sorry! We'll never waste you again!\"\n\nBut the sky kept rising until it was far, far above, where no one could reach it.\n\n\"Now you will have to work for your food,\" the sky said. \"You will have to plant seeds and wait for them to grow. You will have to hunt and cook. Perhaps when you have to work hard for your food, you will learn not to waste it.\"\n\nAnd that is why the sky is so far away today. And that is why people must farm the land and cook their meals. All because some people forgot to be grateful for what they had.",
    "summary": "A Nigerian folk tale about why the sky moved far away when people took it for granted.",
    "length": "medium",
    "mood": ["educational", "adventure"],
    "themes": ["nature"],
    "readingTimeMinutes": 4,
    "coverEmoji": "🌤️"
  }
]
